src/Documents/ТрудовойДоговор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ТрудовойДоговор</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Comment>Нанимаемый на должность сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартыСОУТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияКартыСОУТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпенсацияЗаВредныеУсловия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопОтпуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокрРабочееВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСрока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСрока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавКафедрой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальникСлужбыОТиПБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальникРасчетногоОтдела</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальникОтделаГОиМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбязанностиПреподавателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстТрудовыеПраваПреподавателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбязанностиРаботодателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеФактора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтимулирующиеНадбавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеНадбавки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Надбавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаСчетСредств</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>127</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Компенсации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеВыплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ТрудовойДоговор/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПрикладныеПроцедурыИФункции
Процедура ЗаполнитьТекстом()
	Если Объект.ТекстОбязанностиПреподавателя = "" Тогда
		Элементы.ТекстОбязанностиПреподавателя.Заголовок = Константы.ОбязанностиПреподавателя.Получить();
	Иначе
		Элементы.ТекстОбязанностиПреподавателя.Заголовок = Объект.ТекстОбязанностиПреподавателя;   
	КонецЕсли;      
									  
	Если Объект.ТекстОбязанностиРаботодателя = "" Тогда
		Элементы.ТекстОбязанностиРаботодателя.Заголовок = Константы.ОбязанностиРаботодателя.Получить();
	Иначе
		Элементы.ТекстОбязанностиРаботодателя.Заголовок = Объект.ТекстОбязанностиРаботодателя;   
	КонецЕсли;   
	
	Если Объект.ТекстТрудовыеПраваПреподавателя = "" Тогда
		Элементы.ТекстТрудовыеПраваПреподавателя.Заголовок = Константы.ТрудовыеПраваПреподавателя.Получить();
	Иначе
		Элементы.ТекстТрудовыеПраваПреподавателя.Заголовок = Объект.ТекстТрудовыеПраваПреподавателя;   
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.ГруппаПраваИОбязанностиСторон.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.ГруппаПраваИОбязанностиСторон.Видимость = Ложь;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТекстом();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТекстом();
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТекстОбязанностиПреподавателя   = Элементы.ТекстОбязанностиПреподавателя.Заголовок;
	ТекущийОбъект.ТекстОбязанностиРаботодателя    = Элементы.ТекстОбязанностиРаботодателя.Заголовок;
	ТекущийОбъект.ТекстТрудовыеПраваПреподавателя = Элементы.ТекстТрудовыеПраваПреподавателя.Заголовок;
КонецПроцедуры

&НаСервере
Функция ПодписалДолжностнуюИнструкцию()
	Возврат Не Объект.Преподаватель.ДолжностнаяИнструкция.Пустая();
КонецФункции

&НаСервере
Функция ПодписалСогласиеНаОбработкуПД()
	Возврат Не Объект.Преподаватель.СогласиеНаОбработкуПД.Пустая();
КонецФункции  

&НаСервере
Функция ПодписалОбязательствоСоблюденияРКПД()
	Возврат Не Объект.Преподаватель.ОбязательствоСоблюденияРКПД.Пустая() 
		  И Не Объект.Преподаватель.ОбязательствоСоблюденияРКПД.Ссылка = Неопределено;
КонецФункции

&НаКлиенте
Функция ДокументыПодписаны()
	Если Не ПодписалСогласиеНаОбработкуПД() Тогда
		ПоказатьПредупреждение( , "Сотрудник не подписал согласие на "
								+ "обработку персональных данных."
								, , "Ошибка формирования договора.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПодписалОбязательствоСоблюденияРКПД() Тогда
		ПоказатьПредупреждение( , "Сотрудник не подписал обязательство соблюдения "
								+ "режима конфиденциальности персональных данных."
								, , "Ошибка формирования договора.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПодписалДолжностнуюИнструкцию() Тогда
		ПоказатьПредупреждение( , "Сотрудник не подписал должностную инструкцию. "
								, , "Ошибка формирования договора.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПреподавательПриИзменении(Элемент)
	// Pass
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = Не ДокументыПодписаны();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Преподаватель = Объект.Преподаватель.ПолучитьОбъект();
	
	Попытка
		Преподаватель.Заблокировать();
		Преподаватель.ТрудовойДоговор = ТекущийОбъект.Ссылка;
		Преподаватель.Записать();
		Преподаватель.Разблокировать();
	Исключение
		Сообщить("В данный момент невозможно передать ссылку на этот договор в личный кабинет сотрудника. Попробуйте позже", СтатусСообщения.Важное);  
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент()
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Запись, Ложь); 
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаписать(Команда)
	ЗаписатьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаписатьИЗакрыть(Команда)
	ЗаписатьДокумент();
	Закрыть();
КонецПроцедуры
#КонецОбласти
